#+TITLE: September 13-29, 2019 (17 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2019-09-13>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-sandeepk: 1.176
  :END:
** akshay196
*** Automate the Boring Stuff with Python - Part II [0/5]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1567504631
    :TASKID: READ.1567504631
    :END:
    - [ ] Chapter 14. Working with CSV Files and JSON Data                    (1h)
    - [ ] Chapter 15. Keeping Time, Scheduling Tasks, and Launching Programs  (1h)
    - [ ] Chapter 16. Sending Email and Text Messages                         (1h)
    - [ ] Chapter 17. Manipulating Images                                     (1h)
    - [ ] Chapter 18. Controlling the Keyboard and Mouse with GUI Automation  (1h)
*** Design Patterns in the Real World, an Analysis-Based Approach
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1568391828
    :TASKID: READ.1568391828
    :END:
    by Allen Holub
    https://learning.oreilly.com/videos/design-patterns-in/9781491935828
    - [ ] Introduction                                   (10m)
    - [ ] What is A Design Pattern?                      (35m)
    - [ ] Template Method                                (20m)
    - [ ] Builder: Separating the UI from Domain Object  (30m)
    - [ ] Singleton and Utility                          (60m)
    - [ ] Abstract Factory                               (20m)
    - [ ] Class and Abstract Adapters                    (15m)
    - [ ] Decorator                                      (20m)
    - [ ] Bridge                                         (15m)
    - [ ] Facade                                         (15m)
    - [ ] Prototype and Composite                        (30m)
    - [ ] Flyweight and Flyweight Pool                   (30m)
    - [ ] Proxy                                          (30m)
    - [ ] Command                                        (30m)
    - [ ] Strategy                                       (20m)
    - [ ] The Chain of Responsibility                    (45m)
    - [ ] Iterators (Internal and External)              (30m)
    - [ ] Observer                                       (45m)
    - [ ] Mediator                                       (25m)
    - [ ] Memento                                        (30m)
    - [ ] State                                          (15m)
    - [ ] Active Object                                  (30m)
*** The Little Book of Python Anti-Patterns
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1568393288
    :TASKID: READ.1568393288
    :END:
    https://docs.quantifiedcode.com/python-anti-patterns/index.html
** bhavin192
*** Prepare slides and demo for Rootconf Pune
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       OPS.1568541676
    :TASKID:   OPS.1568541676
    :END:
*** Kubernetes Security: Attacking and Defending Kubernetes
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1568541771
    :TASKID:   READ.1568541771
    :END:
    https://learning.oreilly.com/live-training/courses/kubernetes-security-attacking-and-defending-kubernetes/0636920295549/
*** Blog post about creating PR to src.fedoraproject.org
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1568541846
    :TASKID:   WRITE.1568541846
    :END:
** gandalfdwite
*** Data Structure and Algorithmic Thinking with Python (By Narsimha Karumanchi) [0/3]
    :PROPERTIES:
    :ESTIMATED: 3.0
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: READ.1553531542
    :TASKID: READ.1553531542
    :END:
    - [ ] 18. Divide and Conquer Algorithms    ( 1h)
    - [ ] 19. Dynamic Programming              ( 1h)
    - [ ] 20. Complexity Classes               ( 1h)
*** Cloud Native DevOps [0/6]
    :PROPERTIES:
    :ESTIMATED: 14.0
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: READ.1568308423
    :TASKID: READ.1568308423
    :END:
    - [ ] 2. First Steps with Kubernetes       ( 2h )
    - [ ] 3. Getting Kubernetes                ( 2h )
    - [ ] 4. Workign with Kubernetes Object    ( 3h )
    - [ ] 5. Managing Resources                ( 3h )
    - [ ] 6. Operating Clusters                ( 2h )
    - [ ] 7. Kubernetes Power Tools            ( 2h )
** sandeepk
*** IN_PROGRESS Blog post to write [1/2]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   2.67
    :OWNER: sandeepk
    :ID: WRITE.1560792221
    :TASKID: WRITE.1560792221
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-17 Tue 23:30]--[2019-09-18 Wed 00:10] =>  0:40
    CLOCK: [2019-09-17 Tue 20:30]--[2019-09-17 Tue 20:50] =>  0:20
    CLOCK: [2019-09-17 Tue 09:00]--[2019-09-17 Tue 10:05] =>  1:05
    CLOCK: [2019-09-16 Mon 20:30]--[2019-09-16 Mon 21:05] =>  0:35
    :END:
    - [X] Blog post on Closures   (2h)
    - [ ] Blog post on Generators (2h)
*** IN_PROGRESS [#B] Dive into Pyhton3 [/4]
    :PROPERTIES:
    :ESTIMATED: 11
    :ACTUAL:   1.00
    :OWNER: sandeepk
    :ID: READ.1559639223
    :TASKID: READ.1559639223
    :END:
    :LOGBOOK:
    CLOCK: [2019-09-16 Mon 08:30]--[2019-09-16 Mon 09:30] =>  1:00
    :END:
    - [ ] Chapter 9 - Unit Testing  (2h)
    - [ ] Chapter 10 - Refactoring  (2h)
    - [ ] Chapter 11 - Files        (4h)
    - [ ] Chapter 12 - XML          (3h)

*** 2PI[Slack Bot] [/2]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: sandeepk
    :ID: DEV.1568559197
    :TASKID: DEV.1568559197
    :END:
    - [ ] Repo Creation, Planning of the architecture.  (2h)
    - [ ] Emacs setup for the project.                  (3h)

